# Examples 2.5

### `A4`

```gap
gap> LoadPackage("Subindices");
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
Loading  Subindices 1.0
Homepage: https://github.com/momoeysfn/Subindices
─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
true
gap> G:=AlternatingGroup(4);;
gap> A:=Union(GeneratorsOfGroup(G),[Identity(G)]);
[ (), (2,3,4), (1,2,3) ]
gap> RidPlus(G,A);
4
gap> RidMinus(G,A);
3
gap> RidPM(G,A);
[ 3, 4 ]
gap> rsfA:=RSF(G,A);; Apply(rsfA,s->Length(s)); Set(rsfA);
[ 3, 4 ]
```

### `C4 x C2 x C2`
```gap
gap> G:=Group([(1,2,3,4),(5,6),(7,8)]);;
gap> StructureDescription(G);
"C4 x C2 x C2"
gap> A:=[(5,6),(7,8)];;
gap> RidPlus(G,A);
8
gap> RidMinus(G,A);
8
gap> RidPM(G,A);
[ 8, 8 ]
gap> LidPM(G,A);
[ 8, 8 ]
gap> Id(G,A);
8
gap> A:=Union(GeneratorsOfGroup(G),[Identity(G)]);
[ (), (7,8), (5,6), (1,2,3,4) ]
gap> RidPM(G,A);
[ 2, 4 ]
gap> LidPM(G,A);
[ 2, 4 ]
gap> Id(G,A);
fail
```
